src/CFD/heatedplate6.2/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (0    0 -90)   // 0
    (200  0 -90)   // 1
    (200 45 -90)   // 2
    (0   45 -90)   // 3
    (0    0   0)   // 4
    (200  0   0)   // 5
    (200 45   0)   // 6
    (0   45   0)   // 7

    (250  0 -90)   // 8
    (250 45 -90)   // 9
    (250  0   0)   // 10
    (250  45  0)   // 11

    (450   0 -90)  // 12
    (450  45 -90)  // 13
    (450   0   0)  // 14
    (450  45   0)  // 15

);

blocks
(
    hex ( 0  1  2  3  4  5  6  7) (40 12 1) simpleGrading (1 1 1)
    hex ( 1  8  9  2  5 10 11  6) (10 12 1) simpleGrading (1 1 1)
    hex ( 8 12 13  9 10 14 15 11) (40 12 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    upperWall
    {
        type wall;
        faces
        (
            (3  7  6  2)
            (2  6 11  9) 
            (9 11 15 13) 
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
            (12 14 10 8)
        );
    }
    heatedWall
    {
        type wall;
        faces
        (
            (8 10 5 1)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 15 14 12)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (1 2 9 8)
            (5 10 11 6)
            (8 9 13 12)
            (10 14 15 11)
        );
    }
);

// ************************************************************************* //
